{
  "hola": "¡Hola! ¿En qué puedo ayudarte hoy?",
  "quien eres": "Soy un asistente virtual creado para ayudarte con preguntas frecuentes.",
  "que es xumtech": "XUMTECH es una empresa especializada en transformación digital, experiencia del cliente (CX) y soluciones en la nube.",
  "que servicios ofrece xumtech": "Ofrecemos soluciones con Oracle Cloud, Salesforce, AWS, automatización, CRM, integración y más.",
  "como se entrena este chatbot": "Este chatbot se entrena agregando nuevas preguntas y respuestas en un archivo de conocimiento.",
  "que tecnologias usa xumtech": "XUMTECH trabaja con Oracle Cloud Infrastructure, Salesforce CRM, Adobe Experience Manager, AWS y más.",
  "puedo contactar a soporte": "En esta versión no tengo conexión directa con soporte, pero puedo ayudarte con información general.",
  "donde esta ubicada xumtech": "XUMTECH tiene operaciones en Costa Rica y presencia en Latinoamérica y el Caribe.",
  "cual es tu lenguaje": "Fui desarrollado con Node.js para el backend y HTML, CSS y JavaScript para el frontend.",
  "gracias": "¡Con mucho gusto! Estoy aquí para ayudarte.",
  "adios": "Hasta luego. ¡Que tengas un excelente día!",
  "como funciona este chatbot": "Funciona localmente con tecnología JavaScript y Node.js, leyendo respuestas desde un archivo.",
  "que es oracle cloud": "Oracle Cloud es una plataforma en la nube con servicios de infraestructura, datos, aplicaciones y automatización.",
  "que es salesforce": "Salesforce es un CRM líder en la industria que permite gestionar clientes, ventas, marketing y soporte.",
  "como puedo mejorar la experiencia del cliente": "Mejorando tiempos de respuesta, personalización y automatizando procesos con soluciones como las que ofrece XUMTECH.",
  "que hace un desarrollador fullstack": "Un desarrollador fullstack trabaja tanto en frontend como backend, integrando interfaces y lógica del servidor.",
  "que es oic": "OIC (Oracle Integration Cloud) permite integrar aplicaciones en la nube y locales de forma sencilla.",
  "que es vb studio": "Oracle Visual Builder Studio es una plataforma low-code para construir aplicaciones web y móviles.",
  "como contactar a xumtech": "Podés visitar el sitio web oficial www.xum-tech.com para obtener canales de contacto y más información.",
  "quien creo este bot": "Este bot fue desarrollado como parte de una evaluación técnica de XUMTECH por el candidato William Cubero.",
  "necesito informacion": "Estas son algunas preguntas que podés hacerme:\n\n- ¿Quién eres?\n- ¿Qué es XUMTECH?\n- ¿Qué servicios ofrece XUMTECH?\n- ¿Cómo se entrena este chatbot?\n- ¿Qué tecnologías usa XUMTECH?\n- ¿Puedo contactar a soporte?\n- ¿Dónde está ubicada XUMTECH?\n- ¿Cuál es tu lenguaje?\n- ¿Cómo funciona este chatbot?\n- ¿Qué es Oracle Cloud?\n- ¿Qué es Salesforce?\n- ¿Qué hace un desarrollador fullstack?\n- ¿Qué es OIC?\n- ¿Qué es VB Studio?\n- ¿Cómo contactar a XUMTECH?\n- Gracias\n- Adiós",
  "necesito ayuda": "Con gusto, estas son algunas preguntas que podés hacerme:\n\n- ¿Quién eres?\n- ¿Qué es XUMTECH?\n- ¿Qué servicios ofrece XUMTECH?\n- ¿Cómo se entrena este chatbot?\n- ¿Qué tecnologías usa XUMTECH?\n- ¿Puedo contactar a soporte?\n- ¿Dónde está ubicada XUMTECH?\n- ¿Cuál es tu lenguaje?\n- ¿Cómo funciona este chatbot?\n- ¿Qué es Oracle Cloud?\n- ¿Qué es Salesforce?\n- ¿Qué hace un desarrollador fullstack?\n- ¿Qué es OIC?\n- ¿Qué es VB Studio?\n- ¿Cómo contactar a XUMTECH?\n- Gracias\n- Adiós"
}
